In [1]:
import pandas as pd
import numpy as np
a2d=np.array([[10,20,30],[40,50,60],[70,80,90]])
a2d

array([[10, 20, 30],
       [40, 50, 60],
       [70, 80, 90]])

In [5]:
from pandas import Series,DataFrame
df=DataFrame(a2d,index=['x','y','z'],columns=['a','b','c'])
df

    a   b   c
x  10  20  30
y  40  50  60
z  70  80  90

In [6]:
df['b']

x    20
y    50
z    80
Name: b, dtype: int32

In [8]:
df[['a','b']]

    a   b
x  10  20
y  40  50
z  70  80

In [9]:
df.loc['x']

a    10
b    20
c    30
Name: x, dtype: int32

In [10]:
df.iloc[1]

a    40
b    50
c    60
Name: y, dtype: int32

In [12]:
df['x':'y']

    a   b   c
x  10  20  30
y  40  50  60

In [13]:
#recupere la colonne
df.a

x    10
y    40
z    70
Name: a, dtype: int32

In [14]:
df['a']

x    10
y    40
z    70
Name: a, dtype: int32

In [29]:
df1=DataFrame({'Produit_Id':[23,96,97,15,87],'Name':['computer','python','course','banana','sandwich'],
               'Whole_Sale_Price':[500,35,35,0.5,3],'Retail_Price':[1000,75,75,1,5],'Sales':[100,1000,500,200,300]})
df1

   Produit_Id      Name  Whole_Sale_Price  Retail_Price  Sales
0          23  computer             500.0          1000    100
1          96    python              35.0            75   1000
2          97    course              35.0            75    500
3          15    banana               0.5             1    200
4          87  sandwich               3.0             5    300

In [39]:
#Claculer le revenu de chaque Produit
df2=((df1.Retail_Price-df1.Whole_Sale_Price)*df1.Sales)
df2

0    50000.0
1    40000.0
2    20000.0
3      100.0
4      600.0
dtype: float64

In [40]:
df2.sum()

110700.0

In [48]:
df1['Retail_Price']== 2*df1['Whole_Sale_Price']

0     True
1    False
2    False
3     True
4    False
dtype: bool

In [51]:
df1[df1['Retail_Price']>=2 *df1['Whole_Sale_Price']]

   Produit_Id      Name  Whole_Sale_Price  Retail_Price  Sales
0          23  computer             500.0          1000    100
1          96    python              35.0            75   1000
2          97    course              35.0            75    500
3          15    banana               0.5             1    200

In [98]:
df1['Current_net']=df1.Retail_Price - df1.Whole_Sale_Price
df1

   Produit_Id      Name  Whole_Sale_Price  Retail_Price  Sales  Current_net
0          23  computer             500.0          1000    100        500.0
1          96    python              35.0            75   1000         40.0
2          97    course              35.0            75    500         40.0
3          15    banana               0.5             1    200          0.5
4          87  sandwich               3.0             5    300          2.0

In [99]:
df1['After 15%']=df1.Current_net*0.85
df1

,Produit_Id,Name,Whole_Sale_Price,Retail_Price,Sales,Current_net,After 15%
0,23,computer,500.0,1000,100,500.0,425.000
1,96,python,35.0,75,1000,40.0,34.000
2,97,course,35.0,75,500,40.0,34.000
3,15,banana,0.5,1,200,0.5,0.425
4,87,sandwich,3.0,5,300,2.0,1.700

In [60]:
((df1.Retail_Price - df1.Whole_Sale_Price) * df1.Sales).loc[0]

50000.0

In [62]:
((df1.Retail_Price - df1.Whole_Sale_Price) *df1.Sales).loc[1:2].sum()

60000.0

In [63]:
((df1.Retail_Price - df1.Whole_Sale_Price) *df1.Sales).loc[3:4].sum()

700.0

In [68]:
Revenue_Total=((df1.Retail_Price - df1.Whole_Sale_Price)*df1.Sales).sum()
Revenue_Total

110700.0

In [76]:
 reduction=((df1.Retail_Price - df1.Whole_Sale_Price)* df1.Sales).sum()*0.3
reduction

33210.0

In [94]:
df=DataFrame({'a':[30,40,50,60],'b':[80,70,50,40]}, index=['x','y','z','u'])
df

    a   b
x  30  80
y  40  70
z  50  50
u  60  40

In [95]:
df['r']=[40,50,60,90]
df

    a   b   r
x  30  80  40
y  40  70  50
z  50  50  60
u  60  40  90

In [96]:
df['w']=df.a+df.b
df

    a   b   r    w
x  30  80  40  110
y  40  70  50  110
z  50  50  60  100
u  60  40  90  100

In [8]:
import pandas as pd
from pandas import Series, DataFrame
df3=pd.DataFrame([[10,20,30,40],[60,70,80,90],[160,170,180,190]],index=['a','b','c'],columns=['x','y','z','k'])
df3

     x    y    z    k
a   10   20   30   40
b   60   70   80   90
c  160  170  180  190

In [7]:
df3.loc['a']

0    10
1    20
2    30
3    40
Name: a, dtype: int64

In [10]:
df3.loc['a','k']

40

In [11]:
df3.loc[['a','c'],'z']

a     30
c    180
Name: z, dtype: int64

In [14]:
df3.loc['a',['z','k']]

z    30
k    40
Name: a, dtype: int64

In [15]:
mask=df3['x']>20
mask

a    False
b     True
c     True
Name: x, dtype: bool

In [16]:
df3.loc[mask,['x','y']]

     x    y
b   60   70
c  160  170

In [17]:
df3.loc[df3.x>100]

     x    y    z    k
c  160  170  180  190

In [19]:
df4=DataFrame([[10,30,40],[3,6,8],[60,90,10]],index=list('xyz'), columns=list('abc'))
df4

    a   b   c
x  10  30  40
y   3   6   8
z  60  90  10

In [24]:
df5=DataFrame([[5,6,8],[12,23,45]],index=list('xy'),columns=list('abc'))
df5

    a   b   c
x   5   6   8
y  12  23  45

In [28]:
df_marge = df4.append(df5)
df_marge

C:\Users\Admin\AppData\Local\Temp\ipykernel_10940\170428840.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_marge = df4.append(df5)

    a   b   c
x  10  30  40
y   3   6   8
z  60  90  10
x   5   6   8
y  12  23  45

In [27]:
df6=pd.concat([df4,df5])
df6

    a   b   c
x  10  30  40
y   3   6   8
z  60  90  10
x   5   6   8
y  12  23  45

In [29]:
df7=pd.DataFrame([[10,20,30,40,50],[60,70,80,90,100],[110,120,130,140,150],[160,170,180,190,200],[210,220,230,240,250]],
                 index=['a','b','c','d','e'],columns=list('vwxyz'))
df7

     v    w    x    y    z
a   10   20   30   40   50
b   60   70   80   90  100
c  110  120  130  140  150
d  160  170  180  190  200
e  210  220  230  240  250

In [31]:
df8=pd.DataFrame([[10,20,30,40]],index=['a'],columns=list('vwxt'))
df8

    v   w   x   t
a  10  20  30  40

In [32]:
df9=pd.concat([df7,df8])
df9

     v    w    x      y      z     t
a   10   20   30   40.0   50.0   NaN
b   60   70   80   90.0  100.0   NaN
c  110  120  130  140.0  150.0   NaN
d  160  170  180  190.0  200.0   NaN
e  210  220  230  240.0  250.0   NaN
a   10   20   30    NaN    NaN  40.0

In [34]:
from pandas import Series
data=[59,60,65,68,69,70,72,75,76,77,81,82,84,87,90,95]
s=Series(data, dtype=int)
s

0     59
1     60
2     65
3     68
4     69
5     70
6     72
7     75
8     76
9     77
10    81
11    82
12    84
13    87
14    90
15    95
dtype: int32

In [35]:
s.quantile(0.25)

68.75

In [36]:
s.quantile(0.50)

75.5

In [37]:
s.quantile(0.75)

82.5

In [42]:
import pandas as pd
trip_distance= pd.read_csv('E:/College-Rosemeont/Session 2/Programmation 2/data/data/taxi-distance.csv',header=None).squeeze()
trip_distance

0       1.63
1       0.46
2       0.87
3       2.13
4       1.40
        ...
9994    2.70
9995    4.50
9996    5.59
9997    1.54
9998    5.80
Name: 0, Length: 9999, dtype: float64

In [43]:
Passanger_count=pd.read_csv('E:/College-Rosemeont/Session 2/Programmation 2/data/data/taxi-passenger-count.csv',header=None).squeeze()
Passanger_count

0       1
1       1
2       1
3       1
4       1
       ..
9994    1
9995    1
9996    1
9997    6
9998    1
Name: 0, Length: 9999, dtype: int64

In [44]:
from pandas import DataFrame
df=DataFrame({'Trip_distance':trip_distance,'Passanger_count':Passanger_count})
df

      Trip_distance  Passanger_count
0              1.63                1
1              0.46                1
2              0.87                1
3              2.13                1
4              1.40                1
...             ...              ...
9994           2.70                1
9995           4.50                1
9996           5.59                1
9997           1.54                6
9998           5.80                1

[9999 rows x 2 columns]